1. https://python-forum.io/Thread-Why-any-0-does-not-work-here

In [2]:
import pandas as pd
import numpy as np
data = pd.DataFrame(np.random.randn(10,4))

In [3]:
data[(np.abs(data) > 2).any(1)]

          0         1         2         3
2  2.070938 -0.754125 -0.578396  0.030508
4 -2.458526 -0.388581 -0.295258  1.742435
5 -1.168917  0.380264  0.091132 -2.314294
7 -0.836062  1.441229 -0.038779 -2.470544

2. https://python-forum.io/Thread-Does-the-order-of-columns-in-the-DataFrame-matter

In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame(np.random.rand(10, 5))

In [3]:
df

          0         1         2         3         4
0  0.747633  0.780721  0.844286  0.259460  0.297480
1  0.635457  0.912382  0.088603  0.073868  0.013651
2  0.456573  0.851461  0.756544  0.912180  0.514147
3  0.693911  0.993651  0.098160  0.972654  0.895872
4  0.649762  0.224355  0.037874  0.644416  0.898781
5  0.260622  0.888207  0.144946  0.737670  0.219346
6  0.044278  0.470090  0.074196  0.561507  0.564684
7  0.714427  0.033183  0.088358  0.339084  0.792855
8  0.709693  0.305812  0.678695  0.305444  0.003937
9  0.808768  0.245313  0.881959  0.092300  0.003681

In [6]:
df[[2,1,3,4,0]].values

array([[0.84428564, 0.78072129, 0.25946003, 0.29748   , 0.74763277],
       [0.08860334, 0.91238213, 0.07386793, 0.01365116, 0.635457  ],
       [0.75654394, 0.85146133, 0.91218037, 0.5141473 , 0.45657324],
       [0.09816   , 0.99365091, 0.97265422, 0.89587169, 0.69391068],
       [0.03787446, 0.22435461, 0.64441603, 0.89878116, 0.64976159],
       [0.1449456 , 0.88820663, 0.73767016, 0.2193464 , 0.26062168],
       [0.07419564, 0.47008961, 0.56150661, 0.56468401, 0.04427771],
       [0.08835812, 0.03318305, 0.3390836 , 0.79285514, 0.71442694],
       [0.67869539, 0.30581168, 0.30544357, 0.00393749, 0.70969293],
       [0.88195902, 0.24531337, 0.09229952, 0.00368083, 0.80876803]])

In [2]:
import pandas as pd
data = {'id': ['aa11bc', 'bb22cd', 'cc33ef', 'dd44gh', 'ee55ij','ff66kl','gg77mn','hh88op'], 
        'direction': ["north, south, east, west", "north, south, east, west", "north, south, east, west", "north, south, east, west",
                      "north, south, east, west","north, south, east, west","north, south, east, west"
                     ,"north, south, east, west"]}
df = pd.DataFrame(data, columns = ['id','direction'])

In [27]:
def get_direction(row):
    mapper = {'%s%s' % (a, n): k//2 for k, (a, n) in enumerate(zip('abcdefgh', '12345678'))}
    index = mapper.get(row['id'][1:3].lower())
    if index is not None:
        return row['direction'].split(',')[index]

In [29]:
df['position'] = df.apply(get_direction, axis=1)

In [30]:
df

       id                 direction position
0  aa11bc  north, south, east, west    north
1  bb22cd  north, south, east, west    north
2  cc33ef  north, south, east, west    south
3  dd44gh  north, south, east, west    south
4  ee55ij  north, south, east, west     east
5  ff66kl  north, south, east, west     east
6  gg77mn  north, south, east, west     west
7  hh88op  north, south, east, west     west

3. https://python-forum.io/Thread-Does-the-order-of-columns-in-the-DataFrame-matter?page=2

In [31]:
import pandas as pd
import numpy as np
df = pd.DataFrame({'key1': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'], 
                            'key2': [2000, 2001, 2002, 2001, 2002], 
                           'data': np.arange(5.)})

In [32]:
df

     key1  key2  data
0    Ohio  2000   0.0
1    Ohio  2001   1.0
2    Ohio  2002   2.0
3  Nevada  2001   3.0
4  Nevada  2002   4.0

In [33]:
gg = df.set_index(['key1', 'key2']).unstack('key1')

In [74]:
gg

       data
key1 Nevada Ohio
key2
2000    NaN  0.0
2001    3.0  1.0
2002    4.0  2.0

In [34]:
df

             data
key1   key2
Ohio   2000   0.0
       2001   1.0
       2002   2.0
Nevada 2001   3.0
       2002   4.0

In [70]:
gg  = df

In [73]:
gg.reindex([['data', 'data'],['Ohio', 'Nevada']], axis='columns')

     data
key1 Ohio Nevada
key2
2000  0.0    NaN
2001  1.0    3.0
2002  2.0    4.0

In [31]:
import pandas as pd
df=pd.DataFrame({'a':[1,1,1,1,2,2,2,2,1],
                 'b':[1,1,2,2,2,6,7,7,1]}
               )

In [35]:
df.groupby(['a', 'b']).apply(lambda x:print(x))

   a  b
0  1  1
1  1  1
8  1  1
   a  b
2  1  2
3  1  2
   a  b
4  2  2
   a  b
5  2  6
   a  b
6  2  7
7  2  7

Empty DataFrame
Columns: []
Index: []

In [47]:
df = pd.DataFrame({'x': ['2014-01-01', '2014-01-01']})

In [48]:
df.x=  pd.to_datetime(df.x)

In [46]:
df

            x
0  2014-01-01
1  2014-01-01